#ეს კლასი გამოიყენება მონაცემების შენახვის პროცესის (write_to_db) ფონურ რეჟიმში გასაშვებად
# ანუ იგი ხელს უშლის ძირითადი პროგრამის გაჭედვას SQLite ბაზაში ჩაწერისას.
# ნაკადების - Threads გამოყენებით, იგი საშუალებას გვაძლევს ფუნქციები სინქრონულად ან
# პარალელურ რეჟიმში ვამუშაოთ

import threading

class ThreadedWriter:
    def __init__(self,target_function,*args):
        self.thread = threading.Thread(target=target_function,args=args)
                                    # Python-ში ქმნის ახალ ნაკადს-Thread-ს, ანუ სამუშაო ნაწილს
                                     # target=target_function -> განსაზღვრავს, რომელი ფუნქცია შესრულდება ნაკადის გაშვებისას
                                    # args=args -> ფუნქციისთვის გადასაცემი პარამეტრები
    def start(self):
        self.thread.start() # უშვებს ThreadedWriter-ის შიგნით არსებულ ნაკადს
    def join(self):
        self.thread.join()  # ეს მეთოდი ელოდება Thread-ის დასრულებას
                            # თუ არარის ეს ჩაწერილი: იწერება არასრული მონაცემები,
                                                 #   შესაძლოა მოხდეს მონაცემთა კონფლიქტი,
                                     #   პროგრამის ნახევრად დახურვის შემთხვევაში,  Thread-ი შუა პროცესში გაწყდება,
                                    #  GUI-ს გამოყენება კვლავ შესაძლებელია, თუმცა მონაცემები არასრულია
